<!doctype html>
<html class="theme-next use-motion theme-next-mist">
<head>
  

<meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>


    <meta name="description" content="购买苹果设备如何更经济实惠？, 有故事、有担当、有思考" />



  <meta name="keywords" content="mac, " />





  <meta name="360-site-verification" content="2ebfa6bfe0988ac65c00405e3012ab01" />



<meta name="sogou_site_verification" content="r5H99U6ELU"/>
 



  <meta name="baidu_union_verify" content="63d8c69bdbc435b09f0d1b064de79a19" />



  <meta  baidu-gxt-verify-token="52c8363b5f7cf3520969573f8b170868" />



  <link rel="stylesheet" type="text/css" href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5"/>


<link rel="stylesheet" type="text/css" href="/css/main.css?v=0.4.2"/>



  <link rel="alternate" href="/atom.xml" title="自由" type="application/atom+xml" />



  <link rel="shorticon icon" type="image/x-icon" href="/favicon.ico?v=0.4.2" />


  <title> 购买苹果设备如何更经济实惠？ - 自由 </title>
</head>

<body>
<!--[if lte IE 8]> <div style=' clear: both; height: 59px; padding:0 0 0 15px; position: relative;margin:0 auto;'> <a href="http://windows.microsoft.com/en-US/internet-explorer/products/ie/home?ocid=ie6_countdown_bannercode"><img src="http://static.ixirong.com/picouterie.jpg" border="0" height="42" width="820" alt="You are using an outdated browser. For a faster, safer browsing experience, upgrade for free today or use other browser ,like chrome firefox safari." style='margin-left:auto;margin-right:auto;display: block;'/></a></div> <![endif]-->
  <div class="container one-column page-post-detail">
    <div class="headband"></div>

    <div id="header" class="header">

    <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>
    <script type="text/javascript">
  function hasMobileUA () {
    var nav = window.navigator;
    var ua = nav.userAgent;
    var pa = /iPad|iPhone|Android|Opera Mini|BlackBerry|webOS|UCWEB|Blazer|PSP|IEMobile|Symbian/g;

    return pa.test(ua);
  }

  function isDesktop () {
    return screen.width > 991 && !hasMobileUA();
  }

  function isTablet () {
    return screen.width < 992 && screen.width > 767 && hasMobileUA();
  }

  function isMobile () {
    return screen.width < 767 && hasMobileUA();
  }

  function escapeSelector (selector) {
    return selector.replace(/[!"$%&'()*+,.\/:;<=>?@[\\\]^`{|}~]/g, "\\$&")
  }
  
  function displaySidebar () {
    setTimeout(function () {
      $('.sidebar-toggle').trigger('click');
    }, 800);
  }

</script>


      <div class="header-inner">
        <h1 class="site-meta">
  <span class="logo-line-before"><i></i></span>
  <a href="/" class="brand">
      <span class="logo">
        <i class="icon-logo"></i>
      </span>
      <span class="site-title">自由</span>
  </a>
  <span class="logo-line-after"><i></i></span>
</h1>


  <ul id="menu" class="menu">
    <div class="c-search-form-div" style="display:none;">
      
            
      <form class="menu-item" ><input type="text" id="ts-search-input" class="menu-search-input"></form>
      <script type="text/javascript">
        var option = {
          engineKey: 'd4ab1eac98f4d5235098'
        };
        (function(w,d,t,u,n,s,e){
         s = d.createElement(t);
          s.src = u;
          s.async = 1;
          w[n] = function(r){
            w[n].opts = r;
          };
          e = d.getElementsByTagName(t)[0];
          e.parentNode.insertBefore(s, e);
        })(window,document,'script','//tinysou-cdn.b0.upaiyun.com/ts.js','_ts');
        _ts(option);
      </script>
      

    </div>
    <script type="text/javascript">
      if(isDesktop() || isTablet()){        
        $('.c-search-form-div').css("display","inline");
      }    
    </script>

    
      
      
        <li class="menu-item menu-item-about">
        <a href="/about">
          <i class="menu-item-icon icon-about"></i> <br />
          关于
        </a>
      </li>
      
    
      
      
        <li class="menu-item menu-item-categories">
        <a href="/categories">
          <i class="menu-item-icon icon-categories"></i> <br />
          分类
        </a>
      </li>
      
    
      
      
        <li class="menu-item menu-item-archives">
        <a href="/archives">
          <i class="menu-item-icon icon-archives"></i> <br />
          归档
        </a>
      </li>
      
    
      
      
        <li class="menu-item menu-item-tags">
        <a href="/tags">
          <i class="menu-item-icon icon-tags"></i> <br />
          标签
        </a>
      </li>
      
    
      
      
        <li class="menu-item menu-item-commonweal" style="display:none;">
        <a href="/404.html">
          <i class="menu-item-icon icon-commonweal"></i> <br />
          公益404
        </a>
      </li>
      
    

    <script type="text/javascript">
      if(!isMobile()){
         $('.menu-item-commonweal').css("display","");
      }
    </script>

  </ul>


      </div>
    </div>

    <div id="main" class="main">
      <div class="main-inner">
        <div id="content" class="content">
          

  <div id="posts" class="posts-expand">
    

  <div class="post post-type-normal ">
    <div class="post-header">

      
      
        <h1 class="post-title">
          
          
            
              购买苹果设备如何更经济实惠？
            
          
        </h1>
      

      <div class="post-meta">
        <span class="post-time">
          发表于 2015-05-13
        </span>

        
          <span class="post-category">
            &nbsp; | &nbsp; 分类于
            
              <a href="/categories/mac/">mac</a>

              
              

            
          </span>
        

        
          
            <span class="post-comments-count">
            &nbsp; | &nbsp;
            <a href="/2015/05/13/how-to-decide-to-bye-mac-economicaly/#comments" >
              <span class="post-comments-count ds-thread-count" data-thread-key="2015/05/13/how-to-decide-to-bye-mac-economicaly/"></span>
            </a>
          </span>
          
        
      </div>
    </div>

    <div class="post-body">

      
      

      
        <p>&#x5982;&#x4ECA;&#x81EA;&#x5DF1;&#x5468;&#x56F4;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4EBA;&#x5F00;&#x59CB;&#x4F7F;&#x7528; mac &#x8BBE;&#x5907;&#xFF0C;xirong &#x7684;&#x8BBE;&#x5907;&#x4E3A; <code>macbook pro 13 &#x82F1;&#x5BF8;: 2.7 GHz Retina &#x663E;&#x793A;&#x5C4F;</code>&#xFF0C;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;&#x4E86;&#x5C06;&#x8FD1;9&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7684;&#x786E;&#x4ECE;&#x6548;&#x7387;&#x4E0A;&#x8BB2;&#x8981;&#x6BD4; windows &#x9AD8;&#x6548;&#x4E9B;&#xFF0C;&#x79FB;&#x52A8;&#x529E;&#x516C;&#x65F6;&#x95F4;&#x957F;&#x3001;&#x65E0;&#x7EBF;&#x7F51;&#x7EDC;&#x968F;&#x65F6;&#x8FDE;&#x63A5;&#xFF0C;&#x76D6;&#x4E0A;&#x76D6;&#x5B50;&#x5C31;&#x53EF;&#x4EE5;&#x62FF;&#x7740;&#x8D70;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x6BD4;&#x8F83;&#x5E73;&#x5E38;&#x7684;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BB2;&#xFF0C;UNIX &#x5185;&#x6838;&#x7684;&#x7CFB;&#x7EDF;&#x5929;&#x751F;&#x63A5;&#x8FD1;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x738B;&#x8005; linux &#xFF0C;bash &#x547D;&#x4EE4;&#x57FA;&#x672C;&#x4E0A;&#x4E5F;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x5728; Linux &#x4E0B;&#x5C1D;&#x8BD5;&#x7684;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x5728; MAC &#x4E0B;&#x90FD;&#x53EF;&#x4EE5;&#x5F88;&#x9177;&#x7684;&#x5B8C;&#x6210;&#xFF0C;MAC &#x7684;&#x754C;&#x9762;&#x6BD4; windows &#x5E05;&#x6C14;&#xFF0C;&#x547D;&#x4EE4;&#x884C;&#x7EC8;&#x7AEF;&#x53C8;&#x6BD4; linux &#x66F4;&#x597D;&#x7528;&#xFF0C;&#x6700;&#x4E3A;&#x4E00;&#x540D;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x4F7F;&#x7528; mac &#x6765;&#x4F5C;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x5229;&#x5668;&#xFF0C;&#x662F;&#x5F88;&#x63A8;&#x8350;&#x7684;&#x3002;</p>
<a id="more"></a>
<h1 id="&#x600E;&#x4E48;&#x8D2D;&#x4E70;&#x66F4;&#x7701;&#x94B1;">&#x600E;&#x4E48;&#x8D2D;&#x4E70;&#x66F4;&#x7701;&#x94B1;&#xFF1F;</h1><p>&#x90A3;&#x4E48;&#xFF0C;&#x600E;&#x4E48;&#x6837;&#x8D2D;&#x4E70;mac&#x5462;&#xFF1F;&#x6709;&#x4E9B;&#x4EBA;&#x53EF;&#x80FD;&#x8BF4;&#xFF0C;&#x8FD9;&#x8FD8;&#x7528;&#x8BB2;&#xFF0C;&#x5927;&#x9646;&#x5B98;&#x7F51;&#x4E0A;&#x8D2D;&#x4E70;&#x4E0D;&#x5C31;&#x5F97;&#x4E86;&#xFF0C;&#x5B89;&#x5FC3;&#x3001;&#x65B9;&#x4FBF;&#xFF0C;&#x8D2D;&#x4E70;&#x540E;&#xFF0C;2~3&#x5929;&#x5C31;&#x80FD;&#x5230;&#x8D27;&#xFF0C;&#x662F;&#x554A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5FC3;&#x75BC;&#x94B1;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4EE5;&#x4E0B;&#x5C31;&#x4E0D;&#x7528;&#x770B;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x53BB;&#x5927;&#x9646;&#x5B98;&#x7F51;&#x4E0B;&#x5355;&#x5C31;&#x5F97;&#x4E86;&#x3002; &#x5B98;&#x7F51;&#x4E0A;&#x7684;&#x4EF7;&#x94B1;&#x8FD8;&#x662F;&#x6709;&#x4E9B;&#x8D35;&#x7684; &#xFF0C;&#x6BD5;&#x7ADF;&#x5F88;&#x591A;&#x5173;&#x7A0E;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x6765;&#x57AB;&#x4ED8;&#xFF0C;&#x6211;&#x5176;&#x5B9E;&#x5F88;&#x63A8;&#x8350;&#x53BB;&#x627E;&#x4E00;&#x4E9B;&#x4EE3;&#x8D2D;&#x7684;&#xFF0C;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x5982;&#x679C;&#x4F60;&#x6709;&#x540C;&#x4E8B;&#x670B;&#x53CB;&#x521A;&#x597D;&#x53BB;&#x9999;&#x6E2F;&#xFF0C;&#x90A3;&#x4E48;&#x8BA9;&#x4ED6;&#x7A0D;&#x7ED9;&#x4F60;&#x5427;&#xFF0C;&#x6E2F;&#x7248;&#x7684;&#x8981;&#x6BD4;&#x5927;&#x9646;&#x7684;&#x4FBF;&#x5B9C;&#x7684;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E24;&#x70B9;&#x4F60;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x90A3;&#x4E48;&#x4E07;&#x80FD;&#x7684;&#x6DD8;&#x5B9D;&#x662F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x5356;&#x7684;&#x5F88;&#x9AD8;&#x7684;&#x4EE3;&#x8D2D;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x503C;&#x5F97;&#x4FE1;&#x8D56;&#x7684;&#x3002; xirong &#x7684; MAC &#x5C31;&#x662F;&#x4ECE;&#x6DD8;&#x5B9D;&#x4E0A;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x4E0D;&#x9519;&#x7684;&#x5356;&#x5BB6;&#x90A3;&#x91CC;&#x8D2D;&#x4E70;&#x7684;&#xFF0C;&#x800C;&#x4E14; xirong &#x7684;&#x597D;&#x591A;&#x540C;&#x4E8B;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x4E70;&#x7684;&#x3002;<br>&#x5148;&#x770B;&#x4E00;&#x4E0B;&#x4EF7;&#x94B1;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x5982;&#x4E0B;&#x4E24;&#x5F20;&#x56FE;&#x8DB3;&#x4EE5;&#x8BF4;&#x660E;&#x95EE;&#x9898;&#xFF1A;&#xFF08;xirong &#x7684;&#x673A;&#x5668;&#x5927;&#x9646;&#x5B98;&#x7F51; <code>RMB 10,788</code> &#xFF0C;&#x800C; xirong &#x771F;&#x6B63;&#x82B1;&#x8D39; <code>RMB 8700</code> &#x5DE6;&#x53F3;&#xFF0C;&#x8282;&#x7701;&#x4E86;2000&#x591A;&#x5927;&#x6D0B;&#xFF09;<br><img src="http://static.ixirong.com/pic/mac13macbookpro.png" alt="&#x5927;&#x9646;&#x5B98;&#x7F51;13&#x5BF8;&#x4EF7;&#x683C;"><br><img src="http://static.ixirong.com/pic/mac15macbookpro.png" alt="&#x5927;&#x9646;&#x5B98;&#x7F51;15&#x5BF8;&#x4EF7;&#x683C;"></p>
<p>&#x518D;&#x6765;&#x5BF9;&#x6BD4;&#x4E0B; xirong &#x9009;&#x62E9;&#x7684;&#x4EE3;&#x8D2D;&#x5E97;&#x7684;&#x4EF7;&#x683C;&#xFF1A;<br><img src="http://static.ixirong.com/pic/macmacbookpro-hk.png" alt="&#x9999;&#x6E2F;&#x884C;&#x8D27;&#x4EF7;&#x683C;"></p>
<h1 id="&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;">&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;</h1><p>&#x90A3;&#x4E48;&#xFF0C;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x4EF7;&#x683C;&#x4E0A;&#x8FD9;&#x4E48;&#x6709;&#x4F18;&#x52BF;&#xFF0C;&#x9760;&#x8C31;&#x5417;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x6B63;&#x7248;&#xFF1F;&#x6C34;&#x8D27;&#x673A;&#x5668;&#x5427;&#xFF1F;&#x8D28;&#x91CF;&#x7528;&#x7684;&#x4F4F;&#x5417;&#xFF1F;&#x80FD;&#x4FDD;&#x4FEE;&#x5417;&#xFF1F;&#x6E2F;&#x7248;&#x5427;&#xFF1F;&#x6E2F;&#x7248;&#x662F;&#x4E0D;&#x662F;&#x8D28;&#x91CF;&#x5DEE;&#xFF1F;&#x6E2F;&#x7248;&#x4E0D;&#x80FD;&#x5728;&#x5927;&#x9646;&#x4FDD;&#x4FEE;&#x5427;&#xFF1F;&#x6E2F;&#x7248;&#x5728;&#x5927;&#x9646;&#x80FD;&#x7528;&#x5417;&#xFF1F;&#x8BED;&#x8A00;&#x4E0D;&#x652F;&#x6301;&#x5427;&#xFF1F;<br>xirong &#x5F53;&#x65F6;&#x8D2D;&#x4E70;&#x673A;&#x5668;&#x7684;&#x65F6;&#x5019;&#x6709;&#x5F88;&#x591A;&#x7684;&#x7591;&#x95EE;&#xFF0C;&#x7A0D;&#x5FAE;&#x5217;&#x4E86;&#x4E0B;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x75AF;&#x72C2;&#x7684;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x9762;&#x627E;&#x8FC7;&#x8D44;&#x6599;&#xFF0C;&#x5B8C;&#x4E86;&#x540E;&#xFF0C;&#x5468;&#x56F4;&#x540C;&#x4E8B;&#x8D2D;&#x4E70;&#x7684;&#x673A;&#x5668;&#x53C8;&#x8FDB;&#x884C;&#x4E86;&#x9A8C;&#x8BC1;&#xFF0C;&#x6240;&#x4EE5;&#x4E0B;&#x9762;&#x7684;&#x7ED3;&#x8BBA;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x8FD8;&#x662F;&#x9760;&#x8C31;&#x7684;&#xFF0C;&#x6709;&#x6211;&#x4E2A;&#x4EBA;&#x548C;&#x540C;&#x4E8B;&#x7684;&#x673A;&#x5668;&#x8BC1;&#x660E;&#xFF0C;&#x7ED3;&#x8BBA;&#x6027;&#x51E0;&#x70B9;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1&#x3001;&#x6C34;&#x8D27;&#x548C;&#x884C;&#x8D27;&#xFF0C;&#x53EA;&#x662F;&#x53D1;&#x884C;&#x5730;&#x70B9;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x662F;&#x6B63;&#x54C1;&#xFF0C;&#x53D1;&#x884C;&#x5728;&#x7F8E;&#x56FD;&#x7684;&#xFF0C;&#x6210;&#x4E3A;&#x7F8E;&#x7248;&#x884C;&#x8D27;&#xFF0C;&#x53D1;&#x884C;&#x5728;&#x5927;&#x9646;&#x7684;&#xFF0C;&#x6210;&#x4E3A;&#x5927;&#x9646;&#x884C;&#x8D27;&#xFF0C;&#x53D1;&#x884C;&#x5728;&#x9999;&#x6E2F;&#x7684;&#xFF0C;&#x6210;&#x4E3A;&#x6E2F;&#x7248;&#xFF0C;&#x5BF9;&#x4E8E;iPhone&#x3001;ipad&#x3001;mac&#x7B49;&#x82F9;&#x679C;&#x7535;&#x5B50;&#x4EA7;&#x54C1;&#x7684;&#x4E9A;&#x592A;&#x533A;&#xFF0C;&#x5747;&#x6765;&#x81EA;&#x5927;&#x9646;&#x5BCC;&#x58EB;&#x5EB7;&#x4EE3;&#x5DE5;&#xFF0C;&#x54C1;&#x8D28;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#xFF1B;<br>2&#x3001;&#x5173;&#x4E8E;&#x4EF7;&#x94B1;&#x4F18;&#x52BF; &#x56E0;&#x4E3A; <code>&#x82F9;&#x679C;&#x4E0D;&#x540C;&#x5730;&#x533A;&#x9500;&#x552E;&#x7B56;&#x7565;&#x4E0D;&#x540C;</code>  <code>&#x5173;&#x7A0E;&#x4E0D;&#x540C;&#xFF0C;&#x6BD4;&#x5982;&#x6E2F;&#x8D27;&#x5C31;&#x65E0;&#x5173;&#x7A0E;&#xFF0C;&#x5927;&#x9646;&#x9700;&#x8981;&#x7F34;&#x7EB3;&#x5F88;&#x591A;&#x5173;&#x7A0E;</code>&#xFF1B;<br>3&#x3001;&#x5173;&#x4E8E;&#x4FDD;&#x4FEE;  &#x5927;&#x9646;&#x884C;&#x8D27;&#x3001;&#x6E2F;&#x884C;&#x3001;&#x6FB3;&#x884C;&#x90FD;&#x662F;&#x5728;&#x5927;&#x9646;&#x76F4;&#x8425;&#x5E97;&#x53EF;&#x4EE5;&#x4FDD;&#x4FEE;&#x4E00;&#x5E74; &#xFF0C;&#x5176;&#x5B83;&#x7F8E;&#x7248;&#x3001;&#x6B27;&#x7248;&#x3001;&#x65E5;&#x7248;&#x90FD;&#x65E0;&#x6CD5;&#x4FDD;&#x4FEE;&#xFF1B;<br>4&#x3001;&#x8D2D;&#x4E70;&#x65F6;&#x6CE8;&#x610F;&#x662F;&#x5426;&#x539F;&#x5C01;&#xFF1F;&#x662F;&#x5426;&#x6FC0;&#x6D3B;&#xFF1F;&#x914D;&#x4EF6;&#x662F;&#x5426;&#x66F4;&#x6362;&#xFF1F; &#x57FA;&#x672C;&#x4E0A;&#x9500;&#x91CF;&#x597D;&#x7684;&#x6DD8;&#x5B9D;&#x5356;&#x5BB6;&#x4E0D;&#x4F1A;&#x66F4;&#x6362;&#x914D;&#x4EF6;&#xFF0C;&#x6210;&#x672C;&#x592A;&#x5927;&#xFF0C;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x770B; &#x77E5;&#x4E4E;&#x8BA8;&#x8BBA;<a href="http://www.zhihu.com/question/21990032/answer/21216931?group_id=190479020" target="_blank" rel="external">&#x4E3A;&#x4EC0;&#x4E48;&#x6DD8;&#x5B9D;&#x4E0A; iPad Air &#x6E2F;&#x7248;&#x4EF7;&#x683C;&#x6BD4;&#x9999;&#x6E2F;&#x5B9E;&#x4F53;&#x5E97;&#x8FD8;&#x8981;&#x4F4E;&#xFF1F;&#x5229;&#x6DA6;&#x5728;&#x54EA;&#xFF1F;</a></p>
<h1 id="&#x4E00;&#x53E5;&#x8BDD;&#x603B;&#x7ED3;&#x7B80;&#x5355;&#x660E;&#x4E86;">&#x4E00;&#x53E5;&#x8BDD;&#x603B;&#x7ED3;&#xFF0C;&#x7B80;&#x5355;&#x660E;&#x4E86;</h1><p>&#x5728;&#x5927;&#x9646;&#x8D2D;&#x4E70;&#x82F9;&#x679C;&#x7684;&#x7535;&#x5B50;&#x4EA7;&#x54C1;iMac&#x3001;ipad&#x3001;iPhone&#x3001;mac&#x3001;iPod&#x7B49;&#xFF0C;&#x5982;&#x679C;&#x9999;&#x6E2F;&#x7684;&#x884C;&#x8D27;&#x5728;&#x529F;&#x80FD;&#x4E0A;&#x5B8C;&#x5168;&#x548C;&#x5927;&#x9646;&#x7248;&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x6781;&#x529B;&#x63A8;&#x8350;&#x4F60;&#x8D2D;&#x4E70;&#x6E2F;&#x884C;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x82F9;&#x679C;&#x9999;&#x6E2F;&#x5B98;&#x7F51;&#x4E5F;&#x6BD4;&#x5927;&#x9646;&#x7684;&#x4FBF;&#x5B9C;&#x4E0D;&#x5C11;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x82E5;&#x662F;&#x771F;&#x571F;&#x8C6A;&#xFF0C;&#x4E0D;&#x7528;&#x5728;&#x4E4E;&#x8FD9;&#x4E9B;&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x4F1A;&#x9605;&#x8BFB;&#x5230;&#x8FD9;&#x91CC;&#x4E86; :smile:<br>&#x518D;&#x6B21;&#x90D1;&#x91CD;&#x58F0;&#x660E;&#xFF0C;&#x672C;&#x6587;&#x4E0D;&#x662F;&#x8F6F;&#x6587;&#xFF0C;&#x4E0D;&#x662F;&#x5E7F;&#x544A;&#xFF0C;xirong &#x53EA;&#x662F;&#x53D1;&#x81EA;&#x771F;&#x5FC3;&#x7684;&#x60F3;&#x5E2E;&#x52A9;&#x90A3;&#x4E9B;&#x6709;&#x8FD9;&#x4E9B;&#x8003;&#x8651;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x767E;&#x5EA6;&#x3001;google&#x53BB;&#x641C;&#x7D22;&#x8FD9;&#x5BB6;&#x5E97;&#xFF0C;xirong &#x9009;&#x62E9;&#x7684;&#x9999;&#x6E2F;&#x4EE3;&#x8D2D;&#x5E97;&#x4E3A; <a href="http://appled.cc/" target="_blank" rel="external">&#x5C0F;&#x95F7;&#x7684;&#x6C34;&#x679C;&#x5E97;</a>&#xFF0C;&#x8BE6;&#x7EC6;&#x7684;&#x81EA;&#x5DF1;&#x767B;&#x5F55;&#x9605;&#x8BFB;&#x5427;&#xFF0C;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x53EA;&#x80FD;&#x5E2E;&#x5230;&#x8FD9;&#x91CC;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EC0;&#x4E48;&#x7591;&#x95EE;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED9;&#x6211;&#x8BC4;&#x8BBA;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x53F3;&#x4FA7;&#x7684;&#x8054;&#x7CFB;&#x65B9;&#x5F0F;&#x4E2D;&#x627E;&#x5230;&#x6211;&#xFF0C;&#x8DDF;&#x6211;&#x6C9F;&#x901A;&#x3002;</p>
<p><strong>ps:</strong> &#x77E5;&#x540D;&#x7F51;&#x7AD9; www.ipc.me &#x5F02;&#x6B21;&#x5143;&#x8F6F;&#x4EF6;&#x4E16;&#x754C;&#x65D7;&#x4E0B;&#x7684;&#x7F51;&#x7AD9;&#x4E5F;&#x5199;&#x8FC7;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x63A8;&#x8350;&#x5927;&#x5BB6;&#x8D2D;&#x4E70;&#x6E2F;&#x7248;iPhone6&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x770B; <a href="http://www.ipc.me/iphone-6-wang-luo-jie-xi.html" target="_blank" rel="external">http://www.ipc.me/iphone-6-wang-luo-jie-xi.html</a></p>
<p>&#x4E0B;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x4E3A;&#x5F53;&#x65F6;&#x6574;&#x7406;&#x7684;&#x8BE6;&#x7EC6;&#x8D44;&#x6599;&#xFF0C;&#x8D34;&#x5728;&#x6B64;&#x5904;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x9605;&#x8BFB;&#x4E0B;&#xFF1A;</p>
<h2 id="&#x5173;&#x4E8E;&#x6C34;&#x8D27;&#x548C;&#x884C;&#x8D27;&#x4EE5;&#x4E0B;&#x5F15;&#x7528;&#x6765;&#x81EA;&#x767E;&#x5EA6;&#x767E;&#x79D1;">&#x5173;&#x4E8E;&#x6C34;&#x8D27;&#x548C;&#x884C;&#x8D27;&#xFF0C;&#x4EE5;&#x4E0B;&#x5F15;&#x7528;&#x6765;&#x81EA;&#x767E;&#x5EA6;&#x767E;&#x79D1;&#xFF1A;</h2><p>&#x4EC0;&#x4E48;&#x53EB;&#x6C34;&#x8D27;&#x5462;&#xFF1F;</p>
<blockquote>
<p>&#x6307;&#x5728;&#x67D0;&#x56FD;&#x5BB6;&#x6216;&#x5730;&#x533A;&#x6CA1;&#x6709;&#x7ECF;&#x8FC7;&#x539F;&#x751F;&#x4EA7;&#x5382;&#x5BB6;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x9500;&#x552E;&#x4EE3;&#x7406;&#x800C;&#x8FDB;&#x884C;&#x9500;&#x552E;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x6C34;&#x8D27;&#x5E76;&#x4E0D;&#x662F;&#x5047;&#x8D27;&#x7684;&#x610F;&#x601D;&#x3002;</p>
</blockquote>
<p>&#x4EC0;&#x4E48;&#x662F;&#x884C;&#x8D27;&#xFF1F;</p>
<blockquote>
<p>&#x884C;&#x8D27;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x6C34;&#x8D27;&#x800C;&#x8A00;&#x7684;&#x3002;&#x884C;&#x8D27;&#x6307;&#x7ECF;&#x8FC7;&#x5408;&#x6CD5;&#x7684;&#x62A5;&#x5173;&#x624B;&#x7EED;&#x7B49;&#x6B63;&#x89C4;&#x6E20;&#x9053;&#x8FDB;&#x5165;&#x56FD;&#x5185;&#x5E02;&#x573A;&#x7684;&#x5883;&#x5916;&#x5546;&#x54C1;&#x3002;&#x884C;&#x8D27;&#x80FD;&#x5728;&#x56FD;&#x5185;&#x5E02;&#x573A;&#x4EAB;&#x53D7;&#x5230;&#x552E;&#x540E;&#x670D;&#x52A1;&#x53CA;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x3002;</p>
</blockquote>
<p>&#x5B57;&#x9762;&#x89E3;&#x91CA;&#x5F88;&#x50CF;&#x7ED5;&#x53E3;&#xFF0C;&#x611F;&#x89C9;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x7684;&#x6837;&#x5B50;&#x3002;&#x5176;&#x5B9E;&#x7529;&#x6389;&#x6C34;&#x8D27;&#x5C31;&#x662F;Y&#x8D27;&#x8FD9;&#x79CD;&#x5148;&#x5165;&#x4E3A;&#x4E3B;&#x7684;&#x9519;&#x8BEF;&#x6982;&#x5FF5;&#xFF0C;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x5C31;&#x5BB9;&#x6613;&#x591A;&#x4E86;&#xFF0C;&#x5C31;&#x62FF;iPhone &#x6765;&#x4E3E;&#x4F8B;&#x5427;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x5230;&#x4E2D;&#x56FD;&#x5927;&#x9646;&#x6B63;&#x89C4;&#x6388;&#x6743;&#x5546;&#x5E97;&#x8D2D;&#x4E70;&#x7684;&#x82F9;&#x679C;&#x624B;&#x673A;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x4E2D;&#x56FD;&#x5927;&#x9646;&#x6B63;&#x89C4;&#x6388;&#x6743;&#x548C;&#x4FE1;&#x606F;&#x4EA7;&#x4E1A;&#x90E8;&#x7684;&#x5165;&#x7F51;&#x7684;&#x8BB8;&#x53EF;&#x7B49;&#x76F8;&#x5173;&#x624B;&#x7EED;&#xFF0C;&#x5728;&#x4E2D;&#x56FD;&#x5927;&#x9646;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x53EB;&#x505A;&#x662F;&#x5927;&#x9646;&#x884C;&#x8D27;&#x3002;<br>&#x6BD4;&#x5982;&#x4F60;&#x5728;&#x7F8E;&#x56FD;&#x6B63;&#x54C1;&#x6388;&#x6743;&#x5E97;&#x8D2D;&#x4E70;&#x7684;&#x82F9;&#x679C;&#x624B;&#x673A;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x7F8E;&#x56FD;&#x6B63;&#x89C4;&#x6388;&#x6743;&#x548C;&#x76F8;&#x5173;&#x624B;&#x7EED;&#xFF0C;&#x5728;&#x7F8E;&#x56FD;&#xFF0C;&#x90A3;&#x53EB;&#x7F8E;&#x56FD;&#x884C;&#x8D27;&#x3002;<br>&#x6BD4;&#x5982;&#x4F60;&#x5728;&#x9999;&#x6E2F;&#x6B63;&#x54C1;&#x6388;&#x6743;&#x5E97;&#x8D2D;&#x4E70;&#x7684;&#x82F9;&#x679C;&#x624B;&#x673A;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x9999;&#x6E2F;&#x5730;&#x533A;&#x6B63;&#x89C4;&#x6388;&#x6743;&#x548C;&#x76F8;&#x5173;&#x624B;&#x7EED;&#xFF0C;&#x5728;&#x9999;&#x6E2F;&#x5730;&#x533A;&#xFF0C;&#x90A3;&#x53EB;&#x9999;&#x6E2F;&#x884C;&#x8D27;&#x3002;<br>&#x4EE5;&#x6B64;&#x7C7B;&#x63A8; &#x4F60;&#x5C31;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x53EB;&#x505A;&#x884C;&#x8D27;&#x4E86;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6C34;&#x8D27;&#x5C31;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;<br>&#x4F60;&#x628A;&#x7F8E;&#x56FD;&#x7684;&#x884C;&#x8D27;&#xFF0C;&#x9999;&#x6E2F;&#x7684;&#x884C;&#x8D27;&#xFF0C;&#x82F1;&#x56FD;&#x7684;&#x884C;&#x8D27;&#xFF0C;&#x65E5;&#x672C;&#x7684;&#x884C;&#x8D27;&#xFF0C;&#x65B0;&#x52A0;&#x5761;&#x7684;&#x884C;&#x8D27;&#x975E;&#x6B63;&#x5E38;&#x62A5;&#x5173;&#x7EB3;&#x7A0E;&#x653E;&#x5230;&#x4E2D;&#x56FD;&#x5927;&#x9646;&#x5730;&#x533A;&#x51FA;&#x552E;&#xFF0C;&#x90A3;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x9999;&#x6E2F;&#x6C34;&#x8D27;&#xFF0C;&#x82F1;&#x56FD;&#x6C34;&#x8D27;&#xFF0C;&#x65E5;&#x672C;&#x6C34;&#x8D27;&#x4E86;.&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x90A3;&#x6709;&#x4EBA;&#x5C31;&#x95EE;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x5728;&#x4E2D;&#x56FD;&#x4E70;&#x4E2A;&#x5927;&#x9646;&#x884C;&#x8D27;&#x624B;&#x673A;&#xFF0C;&#x6211;&#x62FF;&#x5230;&#x7F8E;&#x56FD;&#x53BB;&#x5356;&#x90A3;&#x600E;&#x4E48;&#x7B97;&#x3002;&#x90A3;&#x5C31;&#x53EB;&#x4E2D;&#x56FD;&#x6C34;&#x8D27;&#x3002;<br>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x7F8E;&#x7248;&#xFF0C;&#x6E2F;&#x7248;&#xFF0C;&#x82F1;&#x7248;&#xFF0C;&#x65E5;&#x7248;&#xFF0C;&#x65B0;&#x52A0;&#x5761;&#x7248;&#xFF0C;&#x5728;&#x4E2D;&#x56FD;&#x5927;&#x9646;&#x5730;&#x533A;&#x90FD;&#x53EB;&#x6C34;&#x8D27;&#xFF0C;&#x9020;&#x6210;&#x8FD9;&#x4E2A;&#x540D;&#x79F0;&#x4E0A;&#x533A;&#x522B;&#x7684;&#x539F;&#x56E0;&#x4EC5;&#x4EC5;&#x662F;&#x662F;&#x9500;&#x552E;&#x5730;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#xFF0C;&#x9020;&#x6210;&#x4EF7;&#x683C;&#x5DEE;&#x7684;&#x539F;&#x56E0;&#x662F;&#x7531;&#x4E8E;&#x9500;&#x552E;&#x5730;&#x5B9A;&#x4EF7;&#x7B56;&#x7565;&#x548C;&#x6240;&#x5728;&#x56FD;&#x5BB6;&#x7A0E;&#x7387;&#x7B49;&#x7EFC;&#x5408;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x6240;&#x4EE5;&#x8BF7;&#x5404;&#x4F4D;&#x4EE5;&#x540E;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x6C34;&#x8D27;&#x5C31;&#x662F;&#x6B6A;&#x8D27;&#x3002;<br>&#x5982;&#x679C;&#x9047;&#x5230;&#x67D0;&#x79CD;&#x8BF4;&#x6C34;&#x8D27;&#x5C31;&#x662F;&#x6B6A;&#x8D27;&#x7684;&#x670B;&#x53CB;&#x7ED9;&#x4F60;&#x4ECB;&#x7ECD;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FC7;&#x6EE4;&#x6389;&#x4ED6;&#x7684;&#x610F;&#x89C1;&#x3002;</p>
<h2 id="&#x6C34;&#x8D27;&#x548C;&#x884C;&#x8D27;&#x7684;&#x533A;&#x522B;">&#x6C34;&#x8D27;&#x548C;&#x884C;&#x8D27;&#x7684;&#x533A;&#x522B;&#xFF1A;</h2><p>&#x5F88;&#x591A;&#x670B;&#x53CB;&#x4F1A;&#x95EE;&#xFF0C;&#x6C34;&#x8D27;&#x548C;&#x884C;&#x8D27;&#x4EF7;&#x683C;&#x9664;&#x4E86;&#x4EF7;&#x683C;&#x5DEE;&#x522B;&#xFF0C;&#x5176;&#x4ED6;&#x4E1C;&#x897F;&#x6709;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5DEE;&#x522B;&#x5462;&#xFF1F;<br>&#x5C31;&#x82F9;&#x679C;&#x4EA7;&#x54C1;&#x673A;&#x5668;&#x672C;&#x8EAB;&#x800C;&#x8A00;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x533A;&#x522B;&#x3002;<br>&#x51E0;&#x4E4E;&#x5168;&#x4E16;&#x754C;&#x7684;&#x82F9;&#x679C;&#x4EA7;&#x54C1;&#x90FD;&#x662F;&#x4E2D;&#x56FD;&#x5BCC;&#x58EB;&#x5EB7;&#x751F;&#x4EA7;&#x7EC4;&#x88C5;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5DE5;&#x827A;&#x6280;&#x672F;&#x548C;&#x5BA1;&#x6838;&#x6807;&#x51C6;&#x90FD;&#x662F;&#x82F9;&#x679C;&#x51FA;&#x7684;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x54EA;&#x7684;&#x6BD4;&#x54EA;&#x7684;&#x597D;&#x3002;<br>&#x76EE;&#x524D;&#x82F9;&#x679C;&#x6BCF;&#x6B3E;&#x5728;&#x552E;&#x4EA7;&#x54C1;&#x90FD;&#x96C6;&#x6210;&#x51E0;&#x4E4E;&#x5168;&#x7403;&#x6240;&#x6709;&#x8BED;&#x8A00;&#xFF0C;Mac/iPad/iPhone/iPad/ITV<br>&#x6240;&#x4EE5;&#x4F60;&#x5728;&#x4E2D;&#x56FD;&#xFF0C;&#x82F1;&#x56FD;&#xFF0C;&#x7F8E;&#x56FD;&#xFF0C;&#x6CD5;&#x56FD;&#xFF0C;&#x5FB7;&#x56FD;&#xFF0C;&#x610F;&#x5927;&#x5229;&#xFF0C;&#x65E5;&#x672C;&#xFF0C;&#x97E9;&#x56FD;&#x7B49;&#x7B49;&#x6709;&#x8BED;&#x8A00;&#x6587;&#x5B57;&#x7684;&#x56FD;&#x5BB6;&#x4E70;&#x5230;&#x7684;&#x82F9;&#x679C;&#x90FD;&#x80FD;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x8BED;&#x8A00;<br>&#x552F;&#x4E00;&#x4E0D;&#x540C;&#x7684;&#x5C31;&#x662F;&#x5404;&#x56FD;&#x5145;&#x7535;&#x5668;&#x63D2;&#x5934;&#x7684;&#x89C4;&#x683C;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x51E0;&#x5757;&#x94B1;&#x7684;&#x8F6C;&#x6362;&#x5668;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x5C31;&#x5FFD;&#x7565;&#x4E86;</p>
<h2 id="&#x600E;&#x4E48;&#x4FDD;&#x4FEE;&#x5462;">&#x600E;&#x4E48;&#x4FDD;&#x4FEE;&#x5462;&#xFF1F;</h2><p>&#x628A;&#x91CD;&#x70B9;&#x653E;&#x5230;&#x4FDD;&#x4FEE;&#x4E0A;&#x9762;&#x5427;&#x8FD9;&#x4E2A;&#x53EF;&#x80FD;&#x662F;&#x552F;&#x4E00;&#x7684;&#x533A;&#x522B;&#x3002;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E4B;&#x524D;&#x8981;&#x4ECB;&#x7ECD;&#x82F9;&#x679C;&#x4E13;&#x5356;&#x5E97;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x901A;&#x4FD7;&#x7684;&#x8BF4;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#xFF1A;<br>&#x82F9;&#x679C;&#x76F4;&#x8425;&#x5E97;&#xFF1A;&#x5C31;&#x662F;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x81EA;&#x5DF1;&#x5F00;&#x7684;&#x5E97;&#xFF0C;&#x96B6;&#x5C5E;&#x4E8E;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x7684;&#x9500;&#x552E;&#x673A;&#x6784;&#x3002;&#x8001;&#x677F;&#x513F;&#x662F;&#x82F9;&#x679C;&#x516C;&#x53F8;&#xFF0C;&#x76EE;&#x524D;&#x5927;&#x9646;&#x5730;&#x533A;&#x53EA;&#x6709;&#x4E0A;&#x6D77;,&#x5317;&#x4EAC;&#x548C;&#x6DF1;&#x5733;&#x5730;&#x533A;&#x3001;&#x6210;&#x90FD;&#x6709;&#x76F4;&#x8425;&#x5E97;&#xFF1B;<br>&#x82F9;&#x679C;&#x6388;&#x6743;&#x5E97;&#xFF1A;&#x82F9;&#x679C;&#x628A;&#x9500;&#x552E;&#x6388;&#x6743;&#x7ED9;&#x5730;&#x533A;&#x67D0;&#x4E2A;&#x7ECF;&#x9500;&#x5546;&#xFF0C;&#x5C5E;&#x4E8E;&#x6388;&#x6743;&#x5E97;&#x3002;&#x8001;&#x677F;&#x662F;&#x79C1;&#x4EBA;&#xFF0C;&#x76EE;&#x524D;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5E02;&#x7EA7;&#x57CE;&#x5E02;&#x90FD;&#x6709;&#xFF0C;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x8001;&#x677F;&#x4E0D;&#x540C;&#xFF0C;&#x76F4;&#x8425;&#x5E97;&#x5F88;&#x5927;&#xFF0C;&#x6388;&#x6743;&#x5E97;&#x5F88;&#x591A;&#xFF0C;&#x5356;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#x6B63;&#x54C1;&#xFF0C;&#x4EF7;&#x683C;&#x7EDF;&#x4E00;&#x6309;&#x7167;&#x82F9;&#x679C;&#x7684;&#x5B98;&#x65B9;&#x6807;&#x51C6;&#x51FA;&#x552E;&#x3002;</p>
<p>&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x90A3;&#x4E48;&#x8054;&#x7CFB;&#x5230;&#x4FDD;&#x4FEE;&#x552E;&#x540E;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x4F60;&#x4E70;&#x7684;&#x5927;&#x9646;&#x884C;&#x8D27;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x5728;&#x5927;&#x9646;&#x4F60;&#x65E0;&#x7591;&#x53EF;&#x4EE5;&#x5230;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x82F9;&#x679C;&#x76F4;&#x8425;&#x548C;&#x6388;&#x6743;&#x5546;&#x5E97;&#x6216;&#x8005;&#x82F9;&#x679C;&#x6307;&#x5B9A;&#x552E;&#x540E;&#x70B9;&#x90FD;&#x4F1A;&#x53D7;&#x7406;,&#x5176;&#x4ED6;&#x56FD;&#x5BB6;&#x7248;&#x672C;&#x7684;&#x6C34;&#x8D27;&#x90A3;&#x786E;&#x662F;&#x90A3;&#x662F;&#x4E0D;&#x4FDD;&#x4FEE;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6E2F;&#x6FB3;&#x7248;&#x7684;&#x6C34;&#x8D27;&#x673A;&#x5668;&#xFF0C;&#x5176;&#x5B9E;&#x76F4;&#x8425;&#x5E97;&#x662F;&#x53EF;&#x4EE5;&#x4FDD;&#x4FEE;&#x7684;&#x3002;<br>&#x5F53;&#x7136;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#x4E00;&#x5B9A;&#x8981;&#x662F;&#x6709;&#x7684;<br>1&#xFF0E; &#x901A;&#x8FC7;&#x4EA7;&#x54C1;&#x5E8F;&#x5217;&#x53F7;&#x67E5;&#x8BE2;&#x4F60;&#x7684;&#x8BBE;&#x5907;&#x662F;&#x6CA1;&#x6709;&#x8FC7;&#x4FDD;&#x4FEE;&#x65E5;&#x671F;&#x7684;<br>2&#xFF0E;&#x6B64;&#x6B3E;&#x4EA7;&#x54C1;&#x5728;&#x4F60;&#x6240;&#x5728;&#x56FD;&#x5BB6;&#x5730;&#x533A;&#x662F;&#x5728;&#x552E;&#x4EA7;&#x54C1;&#xFF0C;&#x6BD4;&#x5982;&#x5728;iPhone5&#x6CA1;&#x4E0A;&#x5E02;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x62FF;iPhone5&#x53BB;&#x76F4;&#x8425;&#x5E97;&#xFF0C;&#x522B;&#x4EBA;&#x662F;&#x6CA1;&#x529E;&#x6CD5;&#x4E3A;&#x4F60;&#x4FDD;&#x4FEE;&#x7684;<br>3&#xFF0E;&#x7B2C;&#x4E09;&#x70B9;&#x662F;&#x6700;&#x5173;&#x952E;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x5728;&#x5B98;&#x7F51;&#x7528;apple id&#x9884;&#x7EA6;&#x4FDD;&#x4FEE;&#x3002;<br>&#x4EE5;&#x4E0A;&#x6C34;&#x8D27;&#x3001;&#x884C;&#x8D27;&#x6211;&#x8BF4;&#x7684;&#x4FDD;&#x4FEE;&#x8303;&#x56F4;&#xFF0C;&#x90FD;&#x5EFA;&#x7ACB;&#x5728;&#xFF1A;<br>&#x975E;&#x4EBA;&#x4E3A;&#x635F;&#x574F; &#x62C6;&#x673A; , &#x6454;&#x7ECA;&#xFF0C;&#x8FDB;&#x6C34;&#xFF0C;&#x8DCC;&#x843D;&#x7B49;&#x6454;&#x574F;&#x90FD;&#x4E0D;&#x80FD;&#x8FDB;&#x5165;&#x4FDD;&#x4FEE;&#x8303;&#x56F4;&#x7684;&#x3002;<br>&#x989D;&#x5916;&#x518D;&#x8BF4;&#x4E00;&#x70B9;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x4EE5;&#x82F9;&#x679C;&#x7684;&#x786C;&#x4EF6;&#x95EE;&#x9898;&#x90FD;&#x4E0D;&#x662F;&#x4FEE;&#xFF0C;&#x800C;&#x662F;&#x4ECE;&#x65B0;&#x7ED9;&#x4F60;&#x6362;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E3B;&#x673A;&#x3002;<br>&#x518D;&#x6B21;,&#x4EE5;&#x4E0A;&#x6240;&#x8BF4;&#x7684;&#x6C34;&#x8D27;&#x884C;&#x8D27;&#x4EE5;&#x53CA;&#x4FDD;&#x4FEE;&#x90FD;&#x5EFA;&#x7ACB;&#x5728;&#x4F60;&#x6240;&#x4E70;&#x5230;&#x7684;&#x4EA7;&#x54C1;&#x662F;&#x6B63;&#x54C1;&#x4E0A;&#xFF0C;&#x5C71;&#x5BE8;&#x8D27;&#x6216;&#x8005;&#x7FFB;&#x65B0;&#x673A;&#x5668;&#x80AF;&#x5B9A;&#x4E0D;&#x5728;&#x4EE5;&#x4E0A;&#x7684;&#x884C;&#x5217;.</p>
<h2 id="&#x5230;&#x5E95;&#x600E;&#x4E48;&#x533A;&#x5206;&#x673A;&#x5668;&#x662F;&#x5426;&#x7FFB;&#x65B0;&#x6216;&#x8005;&#x5C71;&#x5BE8;&#x673A;&#x5462;">&#x5230;&#x5E95;&#x600E;&#x4E48;&#x533A;&#x5206;&#x673A;&#x5668;&#x662F;&#x5426;&#x7FFB;&#x65B0;&#x6216;&#x8005;&#x5C71;&#x5BE8;&#x673A;&#x5462;?</h2><p>&#x533A;&#x5206;&#x5C71;&#x5BE8;&#x673A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x4F60;&#x53EA;&#x8981;&#x786E;&#x5B9A;&#x4F60;&#x7684;&#x673A;&#x5668;&#x62FF;&#x5230;&#x4EE5;&#x540E;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x8DDF;&#x82F9;&#x679C;&#x5B98;&#x65B9;&#x540C;&#x6B65;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;itunes&#x8FDE;&#x63A5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x662F;&#x5426;&#x662F;&#x5C71;&#x5BE8;&#x673A;&#x3002;<br>&#x533A;&#x5206;&#x662F;&#x5426;&#x662F;&#x7FFB;&#x65B0;&#x673A;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x63D0;&#x5230;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;</p>
<p>&#x5E8F;&#x5217;&#x53F7;<br>&#x82F9;&#x679C;&#x4EA7;&#x54C1;&#x51FA;&#x5382;&#x90FD;&#x81EA;&#x5E26;&#x5168;&#x7403;&#x552F;&#x4E00;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;&#x5C31;&#x50CF;&#x662F;&#x82F9;&#x679C;&#x7684;&#x8EAB;&#x4EFD;&#x8BC1;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x82F9;&#x679C;&#x7CFB;&#x7EDF;&#x7684;&#xFF0C;&#x8BBE;&#x7F6E;-&#x901A;&#x7528;-&#x5173;&#x4E8E;&#x672C;&#x673A; &#x91CC;&#x9762;&#x627E;&#x5F97;&#x5230;&#xFF0C;<br>&#x56E0;&#x4E3A;&#x82F9;&#x679C;&#x7CFB;&#x7EDF;&#x662F;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x72EC;&#x6709;&#x800C;&#x4E14;&#x5C01;&#x95ED;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x53F7;&#x7801;&#x662F;&#x9664;&#x4E86;&#x82F9;&#x679C;&#x516C;&#x53F8;&#xFF0C;&#x65E0;&#x6CD5;&#x4F2A;&#x9020;&#x7684;.&#x6240;&#x4EE5;&#x662F;&#x503C;&#x5F97;&#x76F8;&#x4FE1;&#x7684;<br>&#x4ECE;&#x8FD9;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;&#x53EF;&#x4EE5;&#x67E5;&#x5230;&#x5173;&#x4E8E;&#x4F60;&#x7684;&#x8BBE;&#x5907;&#x7684;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x51FA;&#x5382;&#x65E5;&#x671F;&#x8FD8;&#x6709;&#x9500;&#x552E;&#x5730;&#x4EE5;&#x53CA;&#x6FC0;&#x6D3B;&#x65E5;&#x671F;&#x3002;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x9A8C;&#x8BC1;&#x4F60;&#x7684;&#x673A;&#x5668;&#x662F;&#x5426;&#x662F;&#x7FFB;&#x65B0;&#x673A;&#x7684;&#x91CD;&#x8981;&#x4F50;&#x8BC1;&#x3002;</p>
<p>&#x600E;&#x4E48;&#x67E5;&#x8BE2;&#x5E8F;&#x5217;&#x53F7;&#xFF1F;<br>1&#x3001;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;www.apple.com.cn&#x70B9;&#x51FB;&#x6280;&#x672F;&#x652F;&#x6301;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x51FB;&#x8054;&#x7CFB;apple&#x652F;&#x6301;&#xFF0C;&#x518D;&#x70B9;&#x51FB;&#x68C0;&#x67E5;&#x4F60;&#x7684;&#x4FDD;&#x4FEE;&#x671F;&#x9650; &#x7684;&#x8FDE;&#x63A5; &#x8F93;&#x5165;&#x5E8F;&#x5217;&#x53F7;&#x3002;&#x5373;&#x53EF;&#x67E5;&#x8BE2;&#x5230;&#x4E4B;&#x524D;&#x6211;&#x6240;&#x8BF4;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;<br>2&#x3001;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x82F9;&#x679C;&#x5B98;&#x65B9;&#x552E;&#x540E;&#x70ED;&#x7EBF; 400-627-273 &#x901A;&#x8FC7;&#x76F4;&#x63A5;&#x544A;&#x77E5;&#x4ED6;&#x5E8F;&#x5217;&#x53F7;&#x7684;&#x65B9;&#x5F0F;&#x67E5;&#x8BE2;&#x3002;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x5F0F;&#x66F4;&#x7075;&#x6D3B;</p>
<h2 id="&#x4EC0;&#x4E48;&#x53EB;&#x5168;&#x65B0;&#x539F;&#x5C01;&#x5462;">&#x4EC0;&#x4E48;&#x53EB;&#x5168;&#x65B0;&#x539F;&#x5C01;&#x5462;&#xFF1F;</h2><p>&#x5168;&#x65B0;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x5566;&#xFF0C;&#x539F;&#x5C01;&#x9700;&#x8981;&#x89E3;&#x91CA;&#x4E0B;&#xFF0C;&#x5728;&#x82F9;&#x679C;&#x539F;&#x5382;&#x5305;&#x88C5;&#x76D2;&#x5916;&#x9762;&#x6709;&#x4E00;&#x5C42;&#x5851;&#x6599;&#x8584;&#x819C;&#xFF0C;&#x62C6;&#x6389;&#x5B83;&#x624D;&#x80FD;&#x6253;&#x5F00;&#x82F9;&#x679C;&#x7684;&#x5305;&#x88C5;&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x4E13;&#x5356;&#x5E97;&#x91CC;&#x4E70;&#x5230;&#x7684;&#x6CA1;&#x6709;&#x62C6;&#x5F00;&#x7684;&#x80AF;&#x5B9A;&#x662F;&#x539F;&#x5C01;&#x7684;&#x3002;&#x5BF9;&#x5E94;&#x539F;&#x5C01;&#x7684;&#x8BCD;&#x8BED;&#x5C31;&#x662F; &#x62C6;&#x5C01;&#xFF0C;&#x6216;&#x8005;&#x540E;&#x5C01;<br>&#x4E0B;&#x9762;&#x5207;&#x5165;&#x4E00;&#x4E0B;&#x6C34;&#x8D27;&#x7684;&#x6765;&#x6E90;&#xFF0C;&#x7528;&#x9999;&#x6E2F;&#x6C34;&#x8D27;&#x4E3A;&#x4F8B;&#x3002;&#x6B63;&#x89C4;&#x4ECE;&#x9999;&#x6E2F;&#x6216;&#x8005;&#x7F8E;&#x56FD;&#x8D2D;&#x4E70;&#x6570;&#x7801;&#x4EA7;&#x54C1;&#x5728;&#x5165;&#x5883;&#x65F6;&#x5019;&#x90FD;&#x9700;&#x8981;&#x62A5;&#x5173;&#x7684;&#xFF0C;<br>&#x62A5;&#x5173;&#x5C31;&#x4F1A;&#x6709;&#x5173;&#x7A0E;&#x3002;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x6C34;&#x5BA2;&#x4F1A;&#x91C7;&#x53D6;&#x62C6;&#x5206;&#x673A;&#x5668;&#x548C;&#x5305;&#x88C5;&#xFF0C;&#x5206;&#x522B;&#x8FC7;&#x5883;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x907F;&#x514D;&#x5173;&#x7A0E;&#xFF0C;&#x7136;&#x540E;&#x5230;&#x6DF1;&#x5733;&#x4EE5;&#x540E;&#x518D;&#x4ECE;&#x65B0;&#x7EC4;&#x88C5;&#xFF0C;&#x6240;&#x4EE5;&#x907F;&#x514D;&#x4E86;&#x5173;&#x7A0E;&#xFF0C;&#x4F46;&#x662F;&#x673A;&#x5668;&#x5C31;&#x62C6;&#x5C01;&#x4E86;&#x3002;&#x62C6;&#x5C01;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x610F;&#x601D;&#x4E86;&#x3002;<br>&#x540E;&#x5C01;&#x5C31;&#x662F;&#x67D0;&#x4E9B;&#x5546;&#x5BB6;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x8FF7;&#x60D1;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x5C31;&#x81EA;&#x5DF1;&#x4E70;&#x4E2A;&#x5851;&#x5C01;&#x673A;&#x6765;&#x4ECE;&#x65B0;&#x5851;&#x5C01;&#x4E0A;&#x3002;<br>&#x81F3;&#x4E8E;&#x5982;&#x4F55;&#x533A;&#x5206;&#x539F;&#x5C01;&#x548C;&#x540E;&#x5C01;&#xFF0C;&#x8FD9;&#x4E2A;&#x6211;&#x4EEC;&#x4E0B;&#x6B21;&#x7ED3;&#x5408;&#x56FE;&#x518D;&#x8BF4;</p>
<h2 id="&#x672A;&#x6FC0;&#x6D3B;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;">&#x672A;&#x6FC0;&#x6D3B;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;</h2><p>&#x6BCF;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x82F9;&#x679C;&#x4EA7;&#x54C1;&#x62FF;&#x5230;&#x624B;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x8981;&#x7ECF;&#x5386;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#x6216;&#x8005;itunes &#x6FC0;&#x6D3B;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8DDF;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x6570;&#x636E;&#x5E93;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x624D;&#x80FD;&#x5F00;&#x673A;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x8BA9;&#x4F60;&#x67E5;&#x8BE2;&#x5E8F;&#x5217;&#x53F7;&#x5E8F;&#x5217;&#x53F7;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5982;&#x679C;&#x672A;&#x6FC0;&#x6D3B;&#x662F;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x5C31;&#x6CA1;&#x6709;&#x663E;&#x793A;&#xFF0C;&#x6FC0;&#x6D3B;&#x540E;&#x5C31;&#x4F1A;&#x9A6C;&#x4E0A;&#x663E;&#x793A;&#x3002;<br>&#x6240;&#x4EE5;&#x672A;&#x6FC0;&#x6D3B;&#x7684;&#x8BBE;&#x5907;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EF;&#x4EE5;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x8FD9;&#x4E2A;&#x673A;&#x5668;&#x662F;&#x5168;&#x65B0;&#x7684;&#x3002;<br>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x9009;&#x62E9;&#x673A;&#x5668;&#x7684;&#x65F6;&#x5019;&#x80AF;&#x5B9A;&#x9996;&#x9009;&#x662F;&#x5168;&#x65B0;&#x539F;&#x5C01;&#x672A;&#x6FC0;&#x6D3B;,&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x51FA;&#x5382;&#x5230;&#x4F60;&#x624B;&#x4E0A;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x539F;&#x751F;&#x51FA;&#x5382;&#x72B6;&#x6001;&#x3002;&#x90A3;&#x4F60;&#x4E5F;&#x5927;&#x53EF;&#x653E;&#x5FC3;&#x4E86;&#xFF0C;&#x4E00;&#x822C;&#x8FD9;&#x79CD;&#x673A;&#x5668;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x6B63;&#x89C4;&#x62A5;&#x5173;&#xFF0C;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x6BD4;&#x5206;&#x62C6;&#x8FC7;&#x5173;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x4EF7;&#x683C;&#x80AF;&#x5B9A;&#x4F1A;&#x7A0D;&#x5FAE;&#x9AD8;&#x4E00;&#x4E9B;&#x3002;&#x4E5F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6C34;&#x5206;&#x53EF;&#x8A00;<br>&#x5982;&#x679C;&#x9009;&#x62E9;&#x62C6;&#x5C01;&#x7684;&#x6216;&#x8005;&#x540E;&#x5C01;&#x7684;&#xFF0C;&#x4F60;&#x5C31;&#x8981;&#x7A0D;&#x5FAE;&#x7559;&#x5FC3;&#x4E00;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x8089;&#x8FC7;&#x5173;&#x7684;&#x65B9;&#x5F0F;&#x96BE;&#x514D;&#x4F1A;&#x53D1;&#x751F;&#x673A;&#x5668;&#x4E00;&#x4E9B;&#x78D5;&#x78B0;&#x548C;&#x78E8;&#x82B1;&#xFF0C;&#x8FD8;&#x6709;&#x82F9;&#x679C;&#x914D;&#x4EF6;&#x539F;&#x88C5;&#x7684;&#x548C;&#x4EFF;&#x7684;&#x4EF7;&#x683C;&#x5DEE;&#x8DDD;&#x4E5F;&#x5F88;&#x5927;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x826F;&#x5546;&#x5BB6;&#x4F1A;&#x5077;&#x6362;&#x6570;&#x636E;&#x7EBF;&#x8033;&#x673A;&#x6216;&#x5145;&#x7535;&#x5668;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x9762;&#x6C34;&#x5206;&#x5C31;&#x4F1A;&#x66F4;&#x5927;&#x4E00;&#x4E9B;<br>&#x518D;&#x8005;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x5546;&#x5BB6;&#x4F1A;&#x628A;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;&#x8FC7;&#x51E0;&#x5929;&#x6837;&#x673A;&#xFF0C;&#x6216;&#x8005;&#x5BA2;&#x6237;&#x4E70;&#x4E24;&#x5929;&#x9000;&#x6389;&#x7684;&#x673A;&#x5668;&#x88C5;&#x597D;&#x5356;&#x7ED9;&#x4F60;&#xFF0C;&#x867D;&#x7136;&#x4E1C;&#x897F;&#x4E0D;&#x662F;&#x7FFB;&#x65B0;&#x4E8C;&#x624B;&#x7684;&#x4F46;&#x662F;&#x5FC3;&#x91CC;&#x80AF;&#x5B9A;&#x4E5F;&#x96BE;&#x514D;&#x4E0D;&#x8212;&#x670D;&#x3002;</p>
<h2 id="&#x8D8A;&#x72F1;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;">&#x8D8A;&#x72F1;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;</h2><p>&#x4F5C;&#x4E3A;&#x82F9;&#x679C;&#x6765;&#x8BB2;&#xFF0C;&#x5B83;&#x65E2;&#x662F;&#x786C;&#x4EF6;&#x63D0;&#x4F9B;&#x5546;&#xFF0C;&#x4E5F;&#x662F;&#x8F6F;&#x4EF6;&#x63D0;&#x4F9B;&#x5546;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x65E2;&#x51FA;&#x552E;&#x8BBE;&#x5907;&#xFF0C;&#x4E5F;&#x51FA;&#x552E;&#x8F6F;&#x4EF6;&#x3002;<br>&#x6240;&#x4EE5;&#x4F60;&#x8D2D;&#x4E70;&#x4E86;&#x82F9;&#x679C;&#x4EA7;&#x54C1;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x4F60;&#x80FD;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x6240;&#x6709;&#x8F6F;&#x4EF6;&#x7A0B;&#x5E8F;&#xFF0C;&#x4ED6;&#x7684;&#x8F6F;&#x4EF6;&#x6709;&#x4ED8;&#x8D39;&#x7684;&#x548C;&#x514D;&#x8D39;&#x7684;&#x3002;<br>&#x5728;&#x77E5;&#x8BC6;&#x4EA7;&#x6743;&#x4FDD;&#x62A4;&#x6CD5;&#x5F8B;&#x76F8;&#x5BF9;&#x4E0D;&#x5065;&#x5168;&#x7684;&#x4E2D;&#x56FD;&#x5927;&#x9646;&#xFF0C;&#x8D8A;&#x72F1;&#x5C31;&#x6BD4;&#x8F83;&#x76DB;&#x884C;&#x4E86;&#x3002;<br>&#x8D8A;&#x72F1;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x514D;&#x8D39;&#x7684;&#x4F7F;&#x7528;&#x6536;&#x8D39;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x6709;&#x51E0;&#x4E2A;&#x8BEF;&#x533A;&#x662F;&#x4F60;&#x5FC5;&#x987B;&#x77E5;&#x6653;&#x7684;</p>
<ol>
<li>&#x8D8A;&#x72F1;&#x4F1A;&#x5BF9;&#x673A;&#x5668;&#x9020;&#x6210;&#x635F;&#x574F;&#x3002; &#xFF08;&#x53EA;&#x662F;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x4E0D;&#x4F1A;&#x5BF9;&#x624B;&#x673A;&#x9020;&#x6210;&#x4EFB;&#x4F55;&#x7684;&#x635F;&#x574F;&#x7684;&#xFF09;</li>
<li>&#x8D8A;&#x72F1;&#x4EE5;&#x540E;&#x5B98;&#x65B9;&#x662F;&#x4E0D;&#x4F1A;&#x4FDD;&#x4FEE;&#x7684;&#x3002; &#xFF08;&#x5982;&#x679C;&#x673A;&#x5668;&#x51FA;&#x73B0;&#x786C;&#x4EF6;&#x95EE;&#x9898;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD4;&#x56DE;&#x51FA;&#x5382;&#x8BBE;&#x7F6E;&#x518D;&#x62FF;&#x53BB;&#x4FDD;&#x4FEE;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF09;</li>
<li>&#x4EFB;&#x4F55;&#x673A;&#x5668;&#x90FD;&#x53EF;&#x4EE5;&#x8D8A;&#x72F1;&#xFF08;&#x82F9;&#x679C;&#x4F1A;&#x4E0D;&#x65AD;&#x7684;&#x66F4;&#x65B0;&#x56FA;&#x4EF6;&#x9632;&#x6B62;&#x8D8A;&#x72F1;&#xFF0C;&#x6240;&#x4EE5;&#x9694;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x82F9;&#x679C;&#x5C31;&#x4F1A;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x56FA;&#x4EF6;&#xFF0C;&#x521A;&#x51FA;&#x7684;&#x6700;&#x65B0;&#x56FA;&#x4EF6;&#x4E00;&#x822C;&#x90FD;&#x4E0D;&#x80FD;&#x8D8A;&#x72F1;&#xFF0C;&#x8D8A;&#x72F1;&#x597D;&#x7684;&#x673A;&#x5668;&#x5176;&#x5B9E;&#x53EA;&#x8981;&#x4F60;&#x4E0D;&#x5347;&#x7EA7;&#x5C31;&#x6CA1;&#x5173;&#x7CFB;&#xFF09;</li>
</ol>
<p>&#x7EC8;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x8D8A;&#x72F1;&#x662F;&#x767E;&#x5229;&#x65E0;&#x4E00;&#x5BB3;&#x7684;&#xFF0C;&#x8D8A;&#x72F1;&#x4EE5;&#x540E;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x7CFB;&#x7EDF;&#x7684;&#x5B57;&#x4F53;&#xFF0C;&#x548C;&#x4E00;&#x4E9B;&#x4E2A;&#x6027;&#x7B26;&#x53F7; &#x4E3B;&#x9898;&#xFF0C;&#x4FBF;&#x6377;&#x7684;&#x4E0B;&#x8F7D;&#x94C3;&#x58F0;&#x548C;&#x4E00;&#x4E9B;&#x8F6F;&#x4EF6;&#x7A0B;&#x5E8F;&#x3002;<br>&#x8865;&#x5145;&#xFF1A;&#x8D8A;&#x72F1;&#x540E;&#x4E0D;&#x826F;&#x7684;&#x64CD;&#x4F5C;&#x4E60;&#x60EF;&#x4F1A;&#x964D;&#x4F4E;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x6C89;&#x79EF;&#x7A0B;&#x5E8F;&#x5783;&#x573E;&#x5BFC;&#x81F4;&#x5360;&#x7528;&#x7CFB;&#x7EDF;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x548C;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x53D8;&#x6162;&#x4E0D;&#x7A33;&#x5B9A;.</p>
<p>&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x6709;&#x76F8;&#x5173;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x66FF;&#x4EE3;&#x8D8A;&#x72F1;,&#x505A;&#x5230;&#x514D;&#x8D39;&#x4E0B;&#x8F7D;&#x6536;&#x8D39;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5FEB;&#x7528;&#x82F9;&#x679C;&#x52A9;&#x624B;&#xFF0C;pp&#x52A9;&#x624B;&#x3001;&#x540C;&#x6B65;&#x52A9;&#x624B;&#x7B49;&#x7B49;&#x4E4B;&#x7C7B;&#x7684;&#x8F6F;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x3002;</p>

      
    </div>

    <div class="post-footer">
    
    <! -- 添加捐赠图标 -->
    
<! -- 添加捐赠图标 -->


      
        <div class="post-tags">
          
            <a href="/tags/mac/"> #mac </a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/05/17/how-to-build-ixirong-blog/">使用 github Pages 服务建立 ixirong.com 独立博客全过程</a>
            
          </div>

          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/05/12/how-to-install-jstorm-cluster/">分布式实时日志系统（一）环境搭建之 Jstorm 集群搭建过程/Jstorm集群一键安装部署</a>
            
          </div>
        </div>
      

      
      
    </div>
  </div>



    
      <div class="comments" id="comments">
        

<div class="ds-share" data-thread-key="2015/05/13/how-to-decide-to-bye-mac-economicaly/" data-title="购买苹果设备如何更经济实惠？" data-images="http://www.ixirong.com/2015/05/13/how-to-decide-to-bye-mac-economicaly/" data-content="一篇不错的文章，推荐给大家！" data-url="http://www.ixirong.com/2015/05/13/how-to-decide-to-bye-mac-economicaly/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>  
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>              
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

          <!-- 评论框 -->
          <div class="ds-thread" data-thread-key="2015/05/13/how-to-decide-to-bye-mac-economicaly/"
               data-title="购买苹果设备如何更经济实惠？" data-url="http://www.ixirong.com/2015/05/13/how-to-decide-to-bye-mac-economicaly/">
          </div>
        
      </div>
    
  </div>



          
          <!-- 多说热评文章-->
          <div class="c-duoshuo-hot-artical">
          <p>热评文章</p>
          <div class="ds-top-threads" data-range="weekly" data-num-items="4"></div>
          <div>
          
         
        </div>        
      </div>
               

      
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <div id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <div class="site-overview">
        <div class="site-author motion-element">
          <img class="site-author-image" src="/xirong.jpg" alt="xirong" />
          <p class="site-author-name">xirong</p>
        </div>
        <p class="site-description motion-element">有故事、有担当、有思考</p>
        <div class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">29</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          <div class="site-state-item site-state-categories">
            <a href="/categories">
              <span class="site-state-item-count">15</span>
              <span class="site-state-item-name">分类</span>
              </a>
          </div>

          <div class="site-state-item site-state-tags">
            <a href="/tags">
              <span class="site-state-item-count">51</span>
              <span class="site-state-item-name">标签</span>
              </a>
          </div>
        </div>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml">
              <i class="menu-item-icon icon-feed"></i>
              RSS
            </a>
          </div>
        

        
          <div class="links-of-author motion-element">
            
              <span class="links-of-author-item">
              <a href="https://twitter.com/ixirong" target="_blank">Twitter</a>
            </span>
            
              <span class="links-of-author-item">
              <a href="http://weibo.com/jackieliuxirong" target="_blank">微博</a>
            </span>
            
              <span class="links-of-author-item">
              <a href="https://github.com/xirong/" target="_blank">GitHub</a>
            </span>
            
              <span class="links-of-author-item">
              <a href="http://stackoverflow.com/users/1632013/xirong" target="_blank">StackOverflow</a>
            </span>
                      
           </div>
        

        
        
          <div class="cc-license motion-element">
            <a href="http://creativecommons.org/licenses/by-nc-sa/4.0" class="cc-opacity" target="_blank" rel="external nofollow"> 
              <img src="/images/cc-by-nc-sa.svg" alt="Creative Commons" />
            </a>
          </div>
        

     
        
          <div class="links-of-author motion-element">        
          <p class="site-author-name">Links</p>
            
              <span class="links-of-author-item">
              <a href="http://macshuo.com/" target="_blank">MacTalk</a>
              </span>
            
              <span class="links-of-author-item">
              <a href="http://www.ruanyifeng.com/blog/" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
              <a href="http://coolshell.cn/" target="_blank">酷壳</a>
              </span>
            
              <span class="links-of-author-item">
              <a href="http://www.read.org.cn/" target="_blank">战隼</a>
              </span>
            
              <span class="links-of-author-item">
              <a href="http://www.mifengtd.cn/" target="_blank">褪墨</a>
              </span>
            
              <span class="links-of-author-item">
              <a href="http://mindhacks.cn/" target="_blank">刘未鹏</a>
              </span>
            
          </div>
        
        
      </div>

      
        <div class="post-toc-wrap sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator"></div>
          <div class="post-toc">
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#怎么购买更省钱"><span class="nav-text">怎么购买更省钱？</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#有什么问题"><span class="nav-text">有什么问题？</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#一句话总结简单明了"><span class="nav-text">一句话总结，简单明了</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#关于水货和行货以下引用来自百度百科"><span class="nav-text">关于水货和行货，以下引用来自百度百科：</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#水货和行货的区别"><span class="nav-text">水货和行货的区别：</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#怎么保修呢"><span class="nav-text">怎么保修呢？</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#到底怎么区分机器是否翻新或者山寨机呢"><span class="nav-text">到底怎么区分机器是否翻新或者山寨机呢?</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#什么叫全新原封呢"><span class="nav-text">什么叫全新原封呢？</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#未激活是什么意思"><span class="nav-text">未激活是什么意思？</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#越狱是什么意思"><span class="nav-text">越狱是什么意思？</span></a></li></ol></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator"></div>
        </div>
      
    </div>

  </div>


    </div>

    <div id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">
  
  &copy; &nbsp;  2014 - 
  2015
  
  <span class="author"> xirong</span>
</div>

<div class="powered-by">
  <div style="float:left;margin-top:7px;margin-right:10px;">
  <script type="text/javascript">var cnzz_protocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cspan id='cnzz_stat_icon_1254711542'%3E%3C/span%3E%3Cscript src='" + cnzz_protocol + "s11.cnzz.com/z_stat.php%3Fid%3D1254711542%26show%3Dpic' type='text/javascript'%3E%3C/script%3E"));</script>
  </div>
   鲁ICP备15013969号
</div>
<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io" rel="external nofollow">Hexo</a> 
</div>

<div class="theme-info">
  Clone theme 
  <a class="theme-link" href="https://github.com/xirong/hexo-theme-next" rel="external nofollow">
    NexT
  </a>
</div>





      </div>
    </div>

    <div class="back-to-top"></div>
  </div>

  <!-- <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script> -->

  
  

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>
  <script type="text/javascript">
    $(document).ready(function() {
      $('.content img').each(function () {
        var $image = $(this);
        var $imageWrapLink = $image.parent('a');

        if ($imageWrapLink.size() < 1) {
          $imageWrapLink = $image.wrap('<a href="' + this.getAttribute('src') + '"></a>').parent('a');
        }
        $imageWrapLink.addClass('fancybox');
      });
    });
    $('.fancybox').fancybox({
      helpers: {
        overlay: {
          locked: false
        }
      }
    });
  </script>


  <!-- <script type="text/javascript">
  function hasMobileUA () {
    var nav = window.navigator;
    var ua = nav.userAgent;
    var pa = /iPad|iPhone|Android|Opera Mini|BlackBerry|webOS|UCWEB|Blazer|PSP|IEMobile|Symbian/g;

    return pa.test(ua);
  }

  function isDesktop () {
    return screen.width > 991 && !hasMobileUA();
  }

  function isTablet () {
    return screen.width < 992 && screen.width > 767 && hasMobileUA();
  }

  function isMobile () {
    return screen.width < 767 && hasMobileUA();
  }

  function escapeSelector (selector) {
    return selector.replace(/[!"$%&'()*+,.\/:;<=>?@[\\\]^`{|}~]/g, "\\$&")
  }
  
  function displaySidebar () {
    setTimeout(function () {
      $('.sidebar-toggle').trigger('click');
    }, 800);
  }

</script>
 -->
  

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" id="motion.global">
  $(document).ready(function () {
    var body = $('body');

    var isSidebarVisible = false;
    var sidebarToggle = $('.sidebar-toggle');
    var sidebarToggleLine1st = $('.sidebar-toggle-line-first')
    var sidebarToggleLine2nd = $('.sidebar-toggle-line-middle');
    var sidebarToggleLine3rd = $('.sidebar-toggle-line-last');
    var sidebar = $('.sidebar');

    var SIDEBAR_WIDTH = '320px';
    var SIDEBAR_DISPLAY_DURATION = 300;

    var sidebarToogleLineStatusInit = {width: '100%', opacity: 1, left: 0, rotateZ: 0, top: 0};

    var sidebarToggleLine1stStatusInit = sidebarToogleLineStatusInit;
    var sidebarToggleLine1stStatusArrow = {width: '50%', rotateZ: '-45deg', top: '2px'};
    var sidebarToogleLine1stStatusClose = {width: '100%', rotateZ: '-45deg', top: '5px'};

    var sidebarToggleLine2ndStatusInit = sidebarToogleLineStatusInit;
    var sidebarToggleLine2ndStatusArrow = {width: '90%'};
    var sidebarToogleLine2ndStatusClose = {opacity: 0};

    var sidebarToggleLine3rdStatusInit = sidebarToogleLineStatusInit;
    var sidebarToggleLine3rdStatusArrow = {width: '50%', rotateZ: '45deg', top: '-2px'};
    var sidebarToogleLine3rdStatusClose = {width: '100%', rotateZ: '45deg', top: '-5px'};

    LogoAndMenuMotion();
    sidebarToggleMotion();
    postsListMotion();
    backToTopMotion();    

    $(document)
      .on('sidebar.isShowing', function () {
        isDesktop() && body.velocity(
          {paddingRight: SIDEBAR_WIDTH},
          SIDEBAR_DISPLAY_DURATION
        );
        sidebarContentMotion();
      })
      .on('sidebar.isHiding', function () {});

//search animate
$(function(){
   $('#ts-search-input').focus(function() {  //设置获得焦点时的方法，让文本框变长
    $(this).animate({width: "150"}, 300 );  
    $(this).val(''); //用于清空内容，可选操作
   });
 
   $('#ts-search-input').blur(function() {  //设置失去焦点时的方法，让文本框变短
    $(this).animate({width: "70"}, 300 );
   });
});

    function LogoAndMenuMotion() {
      $.Velocity.RunSequence([
        { e: $('.brand'), p: { opacity: 1 }, o: { duration: 100 } },
        { e: $('.logo'), p: { opacity: 1, top: 0 }, o: { duration: 50} },
        
        { e: $('.logo-line-before i'), p: { translateX: "100%" }, o: { duration: 500, sequenceQueue: false } },
        { e: $('.logo-line-after i'), p: { translateX: "-100%" }, o: { duration: 500, sequenceQueue: false } },
        
        { e: $('.site-title'), p: { opacity: 1, top: 0 }, o: { duration: 200 } }
      ]);
      $('.menu-item').velocity('transition.slideDownIn', {display: null});
    }


    function backToTopMotion () {
      var b2top = $('.back-to-top');
      b2top.on('click', function () {
        body.velocity('scroll');
      });
    }

    function sidebarShowMotion () {

      sidebarToggleLine1st.velocity(sidebarToogleLine1stStatusClose);
      sidebarToggleLine2nd.velocity(sidebarToogleLine2ndStatusClose);
      sidebarToggleLine3rd.velocity(sidebarToogleLine3rdStatusClose);

      sidebar.velocity({width: SIDEBAR_WIDTH}, {
        display: 'block',
        duration: SIDEBAR_DISPLAY_DURATION,
        complete: function () {
          sidebar.addClass('sidebar-active');
          sidebar.trigger('sidebar.didShow');
        }
      });
      sidebar.trigger('sidebar.isShowing');
    }

    function sidebarHideMotion () {
      isDesktop() && body.velocity({paddingRight: 0});
      sidebar.velocity('reverse');

      sidebarToggleLine1st.velocity(sidebarToggleLine1stStatusInit);
      sidebarToggleLine2nd.velocity(sidebarToggleLine2ndStatusInit);
      sidebarToggleLine3rd.velocity(sidebarToggleLine3rdStatusInit);

      sidebar.removeClass('sidebar-active');
      sidebar.trigger('sidebar.isHiding');
    };

    function sidebarContentMotion () {
      $('.sidebar .motion-element').velocity(
        'transition.slideRightIn',
        {stagger: 50, drag: true}
      );
    }

    function postsListMotion () {
      var postMotionOptions = window.postMotionOptions || {stagger: 300, drag: true};
      $('.post').velocity('transition.slideDownIn', postMotionOptions);
    }

    function sidebarToggleMotion () {
      sidebarToggle.on('click', function () {
        isSidebarVisible ? sidebarHideMotion() : sidebarShowMotion();
        isSidebarVisible = !isSidebarVisible;
      });

      sidebarToggle.hover(function () {
        if (isSidebarVisible) {return}
        sidebarToggleLine1st.velocity('stop').velocity(sidebarToggleLine1stStatusArrow);
        sidebarToggleLine2nd.velocity('stop').velocity(sidebarToggleLine2ndStatusArrow);
        sidebarToggleLine3rd.velocity('stop').velocity(sidebarToggleLine3rdStatusArrow);
      }, function () {
        if (isSidebarVisible) {return}
        sidebarToggleLine1st.velocity('stop').velocity(sidebarToggleLine1stStatusInit);
        sidebarToggleLine2nd.velocity('stop').velocity(sidebarToggleLine2ndStatusInit);
        sidebarToggleLine3rd.velocity('stop').velocity(sidebarToggleLine3rdStatusInit);
      });
    }
  });

</script>





  
  
<script type="text/javascript" id="bootstrap.scrollspy.custom">
  /* ========================================================================
  * Bootstrap: scrollspy.js v3.3.2
  * http://getbootstrap.com/javascript/#scrollspy
  * ========================================================================
  * Copyright 2011-2015 Twitter, Inc.
  * Licensed under MIT (https://github.com/twbs/bootstrap/blob/master/LICENSE)
  * ======================================================================== */

  /**
   * Custom by iissnan
   *
   * - Add a `clear.bs.scrollspy` event.
   * - Esacpe targets selector.
   */


  +function ($) {
    'use strict';

    // SCROLLSPY CLASS DEFINITION
    // ==========================

    function ScrollSpy(element, options) {
      this.$body          = $(document.body)
      this.$scrollElement = $(element).is(document.body) ? $(window) : $(element)
      this.options        = $.extend({}, ScrollSpy.DEFAULTS, options)
      this.selector       = (this.options.target || '') + ' .nav li > a'
      this.offsets        = []
      this.targets        = []
      this.activeTarget   = null
      this.scrollHeight   = 0

      this.$scrollElement.on('scroll.bs.scrollspy', $.proxy(this.process, this))
      this.refresh()
      this.process()
    }

    ScrollSpy.VERSION  = '3.3.2'

    ScrollSpy.DEFAULTS = {
      offset: 10
    }

    ScrollSpy.prototype.getScrollHeight = function () {
      return this.$scrollElement[0].scrollHeight || Math.max(this.$body[0].scrollHeight, document.documentElement.scrollHeight)
    }

    ScrollSpy.prototype.refresh = function () {
      var that          = this
      var offsetMethod  = 'offset'
      var offsetBase    = 0

      this.offsets      = []
      this.targets      = []
      this.scrollHeight = this.getScrollHeight()

      if (!$.isWindow(this.$scrollElement[0])) {
        offsetMethod = 'position'
        offsetBase   = this.$scrollElement.scrollTop()
      }

      this.$body
        .find(this.selector)
        .map(function () {
          var $el   = $(this)
          var href  = $el.data('target') || $el.attr('href')
          var $href = /^#./.test(href) && $(escapeSelector(href)) // Need to escape selector.

          return ($href
            && $href.length
            && $href.is(':visible')
            && [[$href[offsetMethod]().top + offsetBase, href]]) || null
        })
        .sort(function (a, b) { return a[0] - b[0] })
        .each(function () {
          that.offsets.push(this[0])
          that.targets.push(this[1])
        })


    }

    ScrollSpy.prototype.process = function () {
      var scrollTop    = this.$scrollElement.scrollTop() + this.options.offset
      var scrollHeight = this.getScrollHeight()
      var maxScroll    = this.options.offset + scrollHeight - this.$scrollElement.height()
      var offsets      = this.offsets
      var targets      = this.targets
      var activeTarget = this.activeTarget
      var i

      if (this.scrollHeight != scrollHeight) {
        this.refresh()
      }

      if (scrollTop >= maxScroll) {
        return activeTarget != (i = targets[targets.length - 1]) && this.activate(i)
      }

      if (activeTarget && scrollTop < offsets[0]) {
        $(this.selector).trigger('clear.bs.scrollspy')  // Add a custom event.
        this.activeTarget = null
        return this.clear()
      }

      for (i = offsets.length; i--;) {
        activeTarget != targets[i]
          && scrollTop >= offsets[i]
          && (!offsets[i + 1] || scrollTop <= offsets[i + 1])
          && this.activate(targets[i])
      }
    }

    ScrollSpy.prototype.activate = function (target) {
      this.activeTarget = target

      this.clear()

      var selector = this.selector +
        '[data-target="' + target + '"],' +
        this.selector + '[href="' + target + '"]'

      var active = $(selector)
        .parents('li')
        .addClass('active')

      if (active.parent('.dropdown-menu').length) {
        active = active
          .closest('li.dropdown')
          .addClass('active')
      }

      active.trigger('activate.bs.scrollspy')
    }

    ScrollSpy.prototype.clear = function () {
      $(this.selector)
        .parentsUntil(this.options.target, '.active')
        .removeClass('active')
    }


    // SCROLLSPY PLUGIN DEFINITION
    // ===========================

    function Plugin(option) {
      return this.each(function () {
        var $this   = $(this)
        var data    = $this.data('bs.scrollspy')
        var options = typeof option == 'object' && option

        if (!data) $this.data('bs.scrollspy', (data = new ScrollSpy(this, options)))
        if (typeof option == 'string') data[option]()
      })
    }

    var old = $.fn.scrollspy

    $.fn.scrollspy             = Plugin
    $.fn.scrollspy.Constructor = ScrollSpy


    // SCROLLSPY NO CONFLICT
    // =====================

    $.fn.scrollspy.noConflict = function () {
      $.fn.scrollspy = old
      return this
    }


    // SCROLLSPY DATA-API
    // ==================

    $(window).on('load.bs.scrollspy.data-api', function () {
      $('[data-spy="scroll"]').each(function () {
        var $spy = $(this)
        Plugin.call($spy, $spy.data())
      })
    })

  }(jQuery);
</script>


<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var $sidebarInner = $('.sidebar-inner');
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.didShow', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;
          var self = this;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      $(indicator).velocity('stop').velocity({
        opacity: action === 'show' ? 0.4 : 0
      }, { duration: 100 });
    }

  });
</script>


  <script type="text/javascript" id="sidebar.nav">
    $(document).ready(function () {
      var html = $('html');

      $('.sidebar-nav li').on('click', function () {
        var item = $(this);
        var activeTabClassName = 'sidebar-nav-active';
        var activePanelClassName = 'sidebar-panel-active';
        if (item.hasClass(activeTabClassName)) {
          return;
        }

        var currentTarget = $('.' + activePanelClassName);
        var target = $('.' + item.data('target'));

        currentTarget.velocity('transition.slideUpOut', 200, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', 200)
            .addClass(activePanelClassName);
        });

        item.siblings().removeClass(activeTabClassName);
        item.addClass(activeTabClassName);
      });

      $('.post-toc a').on('click', function (e) {
        e.preventDefault();
        var offset = $(escapeSelector(this.getAttribute('href'))).offset().top;
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        });
      });

      // Expand sidebar on post detail page by default, when post has a toc.
      if (isDesktop() && HEXO_SIDEBAR_CONFIGURATION === 'post') {
        displaySidebar();
      }
    });
  </script>




   <script type="text/javascript">
    var HEXO_SIDEBAR_CONFIGURATION = 'hide';
    $(document).ready(function () {
      if (HEXO_SIDEBAR_CONFIGURATION === 'always') {
        displaySidebar();
      }
    });
  </script>

  

  
  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"xirong"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  


  
  
  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?35130bce62151673e28ec769bef55e70";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

  
  <script type="text/javascript">
    (function(b,o,i,l,e,r){b.GoogleAnalyticsObject=l;b[l]||(b[l]=
        function(){(b[l].q=b[l].q||[]).push(arguments)});b[l].l=+new Date;
      e=o.createElement(i);r=o.getElementsByTagName(i)[0];
      e.src='//www.google-analytics.com/analytics.js';
      r.parentNode.insertBefore(e,r)}(window,document,'script','ga'));
    ga('create','UA-61803765-1');ga('send','pageview');
  </script>

</body>
</html>
